
# ДЗ №2 (2-месяц)
# 1. Создать класс Person с атрибутами fullname, age, is_married



# 2. Добавить в класс Person метод introduce_myself, который бы распечатывал всю информацию о человеке



# 3. Создать класс Student наследовать его от класса Person и дополнить его методом average_value который запрашивал бы словарь, где ключ это название урока, а значение - оценка. Этот метод должен подсчитывать среднюю оценку ученика по всем предметам.



# 4. Создать класс Teacher и наследовать его от класса Person, дополнить атрибутом experience.



# 5. Добавить в класс Teacher атрибут класса salary



# 6. Также добавить метод в класс Teacher, который бы считал зарплату по следующей формуле: к стандартной зарплате прибавляется бонус 3000 за каждый год опыта.



# 7. Создать объект учителя и распечатать всю информацию о нем и высчитать зарплату



# 8. Создать объект студента и распечатать всю информацию о нем и вывести среднюю оценку