# 1. Создать класс Computer (компьютер) с приватными атрибутами cpu и memory.
# 2. Добавить в класс Computer приватный метод make_computations, в котором бы выполнялись арифметические вычисления(‘+’,  ‘-’,  ‘*’,  ‘/’ ) с атрибутами объекта cpu и memory результат вывести красиво с помощью ‘ f ’ .
# 3. Добавить сеттеры и геттеры к существующим атрибутам и методу.
# 4. Создать класс Phone (телефон) с приватным полем sim_cards_list (список симкард)
# 5. Добавить сеттеры и геттеры к существующему атрибуту.
# 6. Добавить в класс Phone метод call с входящим параметром sim_card_number и call_to_number, в котором бы распечатывалась симуляция звонка в зависимости от переданного номера сим-карты (например: если при вызове метода передать число 1 и номер телефона, распечатывается текст “Идет звонок на номер +996 771 24 47 45” с сим-карты-1 - Beeline).
# 7. Создать класс SmartPhone и наследовать его от 2-х классов Computer и Phone.
# 8. Добавить метод в класс SmartPhone use_gps с входящим параметром location, который бы распечатывал симуляцию проложения маршрута до локации.
# 9. Добавить в класс SmartPhone метод add_memeory_card который бы увеличивал память телефона
# 10. Создать 1 объект компьютера, 1 объект телефона и 2 объекта смартфона
# 11. Распечатать информацию о созданных объектах с помощью метода info
# 12. Опробовать все возможные методы каждого объекта
